app/Http/Controllers/Admin/Role/RoleAndPermissionController.php

    public function index() : View
    {
        $roles = Role::all();
        $permissions = Permission::all()->groupBy('group_name');
        $users = Admin::where([['delete',0],['status',1]])->get();
---
select * from `roles`
select * from `permissions`
select * from `admins` where (`delete` = 0 and `status` = 1)

    public function getUserPermission(string $id) : Response {
        $user = Admin::findOrFail($id);
        $permissions = Permission::all()->groupBy('group_name');
---
select * from `admins` where `admins`.`id` = '2' limit 1
select * from `permissions`