app/Http/Controllers/Admin/User/UserController.php

select * from `admins` where `delete` = '0'
select * from `roles`
---
    public function index()
    {
        $users = Admin::where('delete','0')->get();
        $roles = Role::all();