app/Http/Controllers/Admin/Localization/BackendLanguageController.php

select * from `languages` where `delete` = 0
select * from `api_keys` limit 1
---
    public function index()
    {
        $languages = Language::where('delete', 0)->get();
        $api_key = ApiKey::first();

select * from `api_keys` limit 1
---
    public function storeTranslateString(Request $data) : RedirectResponse {
        $api_key =ApiKey::first();