app/Http/Controllers/Admin/Localization/LanguageController.php

    public function index()
    {
        $languages = Language::where('delete',0)->get();
---
select * from `languages` where `delete` = 0