app/Http/Controllers/Admin/Settings/MaintenanceModeController.php

select * from `admins` where `admins`.`id` in (1)
select * from `maintenances` order by `maintenances`.`id` desc
---
    public function maintenanceMode()  {
        $maintenances = Maintenance::with('admin')->orderBy('maintenances.id','DESC')->get();