app/Helpers/helpers.php

select * from `languages` where `default` = 1 limit 1
---
function getLanguageSession() : string {
    if(Cookie::get('language') !== null){
        return Cookie::get('language');
    }else{
        try {
            $language = Language::where('default',1)->first();